app/controllers/friends_controller.rb

INSERT INTO "friends" ("full_name", "email", "phone", "telegram", "discord", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "email" = ?, "phone" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["email", "kovtunova@mriya.org.ua"], ["phone", "+380 96 838 48 88"], ["updated_at", "2022-12-08 21:33:39.339149"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)